Revit 2027 API
BuiltInFailures.SkylightFailures.MinSkylightWidthMetric Property
 The minimum skylight width is 203.2 millimeters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MinSkylightWidthMetric { get; }
Public Shared ReadOnly Property MinSkylightWidthMetric As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MinSkylightWidthMetric {
	FailureDefinitionId^ get ();
}
static member MinSkylightWidthMetric : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SkylightFailures Class
Autodesk.Revit.DB Namespace